{
  "model_type": "gemma3n",
  "architectures": [
    "Gemma3nForConditionalGeneration"
  ],
  "vocab_size": 256000,
  "hidden_size": 1024,
  "num_attention_heads": 6,
  "num_hidden_layers": 8,
  "intermediate_size": 2048,
  "max_position_embeddings": 2048,
  "torch_dtype": "float16",
  "transformers_version": "4.38.0",
  "_name_or_path": "google/gemma-3n-mobile",
  "use_cache": true,
  "mobile_optimized": true,
  "quantization": "mobile_ready",
  "approximate_size_mb": 50
}