{
  "metadata": {
    "total_size": 52428800
  },
  "weight_map": {
    "model.embed_tokens.weight": "model.safetensors",
    "model.layers.0.self_attn.q_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.k_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.v_proj.weight": "model.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model.safetensors",
    "model.norm.weight": "model.safetensors",
    "lm_head.weight": "model.safetensors"
  }
}